'''Создайте несколько переменных разных типоп.Проверьте к какому типу относятся созданные переменные'''

a = 50
print(a,type(a))

a = 'Hello world!'
print(a,type(a))

a = 3.14
print(a,type(a))

b = {1,2,3}
c = [22,23,25]
d = {'a':1, 'b':2, 'c':3}
print(type(b),type(c),type(d))
